app/controllers/friends_controller.rb

INSERT INTO "friends" ("fname", "lname", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "fname" = ?, "lname" = ?, "email" = ?, "phone" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["fname", "Dat"], ["lname", "Friend"], ["email", "Dfriend@mail.com"], ["phone", "+44 12345"], ["twitter", "@Frienddat"], ["updated_at", "2022-06-11 05:01:03.200148"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)