app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 5]]
---
  def index
    # @friends = Friend.all
    if user_signed_in?
    @friends = Friend.where(user_id: current_user.id)